[
  "The human brain contains approximately 86 billion neurons.",
  "Honey never spoils. Archaeologists have found pots of honey in ancient Egyptian tombs that are over 3,000 years old and still perfectly edible.",
  "A group of flamingos is called a 'flamboyance'.",
  "The shortest war in history was between Britain and Zanzibar on August 27, 1896. It lasted only 38-45 minutes.",
  "Bananas are berries, but strawberries aren't.",
  "The Great Wall of China isn't visible from space with the naked eye, contrary to popular belief.",
  "Octopuses have three hearts and blue blood.",
  "A single cloud can weigh more than a million pounds.",
  "The human body contains about 37.2 trillion cells.",
  "Lightning strikes the Earth about 100 times per second.",
  "The longest recorded flight of a chicken is 13 seconds.",
  "Your stomach gets an entirely new lining every 3-5 days.",
  "The word 'set' has the most different meanings in the English language.",
  "A shrimp's heart is in its head.",
  "It's impossible to hum while holding your nose closed.",
  "The fingerprints of koalas are so similar to humans that they could taint crime scenes.",
  "A group of pandas is called an 'embarrassment'.",
  "The human eye can distinguish about 10 million colors.",
  "Wombat poop is cube-shaped.",
  "The longest place name in the world has 85 letters.",
  "A day on Venus is longer than its year.",
  "The unicorn is Scotland's national animal.",
  "Bubble wrap was originally invented as wallpaper.",
  "The human brain uses about 20% of the body's total energy.",
  "A group of owls is called a 'parliament'.",
  "The shortest complete sentence in English is 'I am.'",
  "Dolphins have names for each other.",
  "The human heart beats about 100,000 times per day.",
  "A group of crows is called a 'murder'.",
  "The Earth's core is as hot as the Sun's surface.",
  "Sharks have been around longer than trees.",
  "The human nose can detect about 1 trillion different scents.",
  "A group of jellyfish is called a 'smack'.",
  "The longest hiccuping fit lasted 68 years.",
  "Your brain is about 75% water.",
  "A group of hedgehogs is called a 'prickle'.",
  "The human body produces about 25 million new cells every second.",
  "A group of ferrets is called a 'business'.",
  "The average person walks past 36 murderers in their lifetime.",
  "A group of pugs is called a 'grumble'.",
  "The human skeleton is made up of 270 bones at birth, but only 206 in adulthood.",
  "A group of ravens is called an 'unkindness'.",
  "The human brain can process visual information in as little as 13 milliseconds.",
  "A group of rhinos is called a 'crash'.",
  "The human body contains enough iron to make a 3-inch nail.",
  "A group of zebras is called a 'dazzle'.",
  "The human eye blinks about 17,000 times per day.",
  "A group of hippos is called a 'bloat'.",
  "The human body produces about 1.5 liters of saliva per day.",
  "A group of giraffes is called a 'tower'.",
  "The human brain weighs about 3 pounds.",
  "A group of kangaroos is called a 'mob'.",
  "The human body has about 5 million hair follicles.",
  "A group of lemurs is called a 'conspiracy'.",
  "The human heart is about the size of a fist.",
  "A group of meerkats is called a 'gang'.",
  "The human body contains about 60% water.",
  "A group of otters is called a 'raft'.",
  "The human brain has about 100 billion neurons.",
  "A group of peacocks is called an 'ostentation'.",
  "The human body has 12 systems.",
  "A group of penguins is called a 'waddle'.",
  "The human eye can see about 10 million colors.",
  "A group of porcupines is called a 'prickle'.",
  "The human body has 206 bones in adulthood.",
  "A group of seals is called a 'pod'.",
  "The human brain uses 20% of the body's energy.",
  "A group of sharks is called a 'shiver'.",
  "The human heart beats about 3 billion times in a lifetime.",
  "A group of sloths is called a 'bed'.",
  "The human body has about 650 muscles.",
  "A group of squirrels is called a 'scurry'.",
  "The human eye can focus on about 50 different objects per second.",
  "A group of tigers is called a 'streak'.",
  "The human body produces about 2 million red blood cells per second.",
  "A group of turtles is called a 'bale'.",
  "The human brain can store about 2.5 petabytes of information.",
  "A group of whales is called a 'pod'.",
  "The human body has about 37 trillion cells.",
  "A group of wolves is called a 'pack'.",
  "The human heart pumps about 2,000 gallons of blood per day.",
  "A group of elephants is called a 'herd'.",
  "New fun fact"
]